
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗакупкаТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакупкаТоваров.Дата,
	|	ЗакупкаТоваров.Номер,
	|	ЗакупкаТоваров.Поставщик,
	|	ЗакупкаТоваров.Склад,
	|	ЗакупкаТоваров.Товраы.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ЗакупкаТоваров КАК ЗакупкаТоваров
	|ГДЕ
	|	ЗакупкаТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТовраыШапка = Макет.ПолучитьОбласть("ТовраыШапка");
	ОбластьТовраы = Макет.ПолучитьОбласть("Товраы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТовраыШапка);
		ВыборкаТовраы = Выборка.Товраы.Выбрать();
		Пока ВыборкаТовраы.Следующий() Цикл
			ОбластьТовраы.Параметры.Заполнить(ВыборкаТовраы);
			ТабДок.Вывести(ОбластьТовраы, ВыборкаТовраы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
