Процедура ОбработкаПроведения(Отказ, Режим)
			
	
	
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;
	Движения.РегистрБухУчет.Записывать         = Истина;
	Движения.Задолженности.Записывать          = Истина;
	Движения.СвободныеОстатки.Записывать       = Истина;
	
	//Берем из регистра сведений последний установленный метод расчета себестоимости
	МетодРасчетаСебестоимости = РегистрыСведений.СпособРасчетаСебестоимости.ПолучитьПоследнее(Дата);
	
	Если МетодРасчетаСебестоимости = Неопределено Тогда
		Сообщить("Не задан способ расчёта себестоимости!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущийМетод = МетодРасчетаСебестоимости.МетодРасчета;
	
	
	//Если метод расчета себестоимости - по-среднему, то в партии указываем пустую ссылку
	//В другом случае - ссылку на текущий документ
	
	
	//Если метод не установлен - отказываем в проведении
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		
		Если ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.FIFO ИЛИ ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.LIFO Тогда
			
			//регистр ПартииТоваровНаСкладах Приход
			Движение = Движения.ПартииТоваровНаСкладах.Добавить();
			Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
			Движение.Период       = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Товар;
			Движение.Склад        = Склад;
			Движение.Партия       = Ссылка;
			Движение.Количество   = ТекСтрокаТовары.Количество;
			Движение.Сумма        = ТекСтрокаТовары.Сумма;
			
		ИначеЕсли ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.ПоСреднему Тогда
			
		    //регистр ПартииТоваровНаСкладах Приход
			Движение = Движения.ПартииТоваровНаСкладах.Добавить();
			Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
			Движение.Период       = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Товар;
			Движение.Склад        = Склад;
			Движение.Партия       = Документы.ЗакупкаТоваров.ПустаяСсылка();
			Движение.Количество   = ТекСтрокаТовары.Количество;
			Движение.Сумма        = ТекСтрокаТовары.Сумма;
		КонецЕсли;
		
	

		
		//Проходим по каждой строке табличной части и цену товара сохраняем в регистр сведений
		МенеджерЗаписи = РегистрыСведений.ЦенаТовара.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = ТекСтрокаТовары.Товар;
		МенеджерЗаписи.Цена         = ТекСтрокаТовары.Цена;
		МенеджерЗаписи.Записать(); //Если запись есть - обновит, если нет - создаст
		
		
		//РегистрБухУчет
		//в цикле, т.к. субконто для каждого товара из ТЧ
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Товары;  //41
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Поставщики; //62
		Движение.Период = Дата;
		Движение.Сумма  = ТекСтрокаТовары.Сумма;
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаТовары.Товар;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты]  = Поставщик;
		
		
		//Регистр СвободныеОстатки
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Склад = Склад;
		Движение.КоличествоВСвободномОстатке = ТекСтрокаТовары.Количество;
		
		
	КонецЦикла;
	
	
	Движение = Движения.Задолженности.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Контрагент  = Поставщик;
	Движение.СуммаДолга  = СуммаДокумента;
	Движение.Период      = Дата;
	
	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Вычисление суммы всего документа
	СуммаДокумента = Товары.Итог("Сумма"); //Обращаемся к колонке Сумма в ТЧ Товары
		
КонецПроцедуры
