
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентДанные = Объект.Контрагент;
	
	Если ЗначениеЗаполнено(КонтрагентДанные) Тогда
		Объект.Сумма = КонтрагентПриИзмененииНаСервере(КонтрагентДанные);
	Иначе
		Объект.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КонтрагентПриИзмененииНаСервере(Контрагент)
	 ДолгиКонтрагента = РегистрыНакопления.Задолженности;
	 
	 ФильтрКонтр = Новый Структура;
	 ФильтрКонтр.Вставить("Контрагент", Контрагент);
	 
	 Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 ВременнойМомент = Новый МоментВремени(Объект.Дата, Объект.Ссылка);
	 Иначе
		 ВременнойМомент = Неопределено;
	 КонецЕсли;
	 
	 ТаблицаДолг = ДолгиКонтрагента.Остатки(ВременнойМомент, ФильтрКонтр, "Контрагент", "СуммаДолга");
	 
	 ДолгСумма = ТаблицаДолг.Итог("СуммаДолга");
	 	 
	 Если ДолгСумма < 0 Тогда
	     Возврат -ДолгСумма;
	 Иначе
	     Возврат 0;
	 КонецЕсли;  
	 
КонецФункции


