//При изменении цены автоматически вычисляется сумма
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры


//При изменении количества автоматически вычисляется сумма
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры

&НаСервере
Процедура ЗабронироватьНаСервере()
	//Преобразование данных с формы в объект доукмента
	ОбъектДокумента = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПродажаТоваров"));
	ОбъектДокумента.БронированиеТоваров();
	
	//Отображаем возможные изменения пользователю
	ЗначениеВДанныеФормы(ОбъектДокумента,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Забронировать(Команда)
	ЗабронироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	//Чтобы знать по какому товару считать ост - выясняем, из какой стр ТабЧ нужно его брать
	Стр = Элементы.Товары.ТекущиеДанные;
	//И проверяем, есть ли вообще эта строка в доке!
	Если Стр <> Неопределено Тогда
		ОстатокТовара = ОпределениеОстаткаТовара(Стр.Товар); //В кач-ве параметра - ссылка на товар из тек активной стр
	Иначе
		ОстатокТовара = 0;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ОпределениеОстаткаТовара(ТекТовар)
	ОстаткиТов = РегистрыНакопления.ПартииТоваровНаСкладах;  //Эта пременная дает доступ к менеджеру этого регистра
	
	ФильтрТов = Новый Структура; //В этой структуре будет фильтр для поиска данного товара на данном складе
	ФильтрТов.Вставить("Номенклатура", ТекТовар);
	ФильтрТов.Вставить("Склад", Объект.Склад);
	
	//определяем временной момент
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		//Если док уже был записан - достаем моментВремени из его даты
		ВременнойМомент = Новый МоментВремени(Объект.Дата, Объект.Ссылка);
	Иначе
		//Если док новый (нет ссылки и даты), то берем актуальные остатки
		ВременнойМомент = Неопределено;
	КонецЕсли;
	
	//Запрос к БД, результат - таблица с нужными строками
	ТаблицаОст = ОстаткиТов.Остатки(ВременнойМомент, ФильтрТов, "Номенклатура", "Количество");
	//Суммирование строк таблицы
	Возврат ТаблицаОст.Итог("Количество");
	
КонецФункции;
