
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//Блокируем в регистре остатков товары из документа
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный; 
	Блокировка.Заблокировать();
	
	
	
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;
	
	//Достаем с формы документа
	ТекущийМетод = НовыйМетодРасчетаСебестоимости;
	
	//Берем из регистра сведений последний установленный метод расчета себестоимости
	ПрошлыйМетодРасчетаСебестоимости = РегистрыСведений.СпособРасчетаСебестоимости.ПолучитьПоследнее(Дата);
	
	Если ПрошлыйМетодРасчетаСебестоимости = Неопределено Тогда
		Сообщить("Нет прошлого метода! Корректировка не нужна");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПрошлыйМетод = ПрошлыйМетодРасчетаСебестоимости.МетодРасчета;
	
	//После того как мы достали из регистра прошлый метод, можем записать новый
	МенеджерЗаписи = РегистрыСведений.СпособРасчетаСебестоимости.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.МетодРасчета = НовыйМетодРасчетаСебестоимости;
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.Записать();
	
	
	
	Если (ПрошлыйМетод = Перечисления.СпособыРасчетаСебестоимости.FIFO И ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.LIFO) Тогда
		Сообщить("Корректировать не нужно!");
		Отказ = Истина;
		Возврат;
		
	
	ИначеЕсли (ПрошлыйМетод = Перечисления.СпособыРасчетаСебестоимости.LIFO И ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.FIFO) Тогда // !!! Добавлен "Тогда" !!!
		Сообщить("Корректировать не нужно!");
		Отказ = Истина;
		Возврат;
		
	
	ИначеЕсли (ПрошлыйМетод = Перечисления.СпособыРасчетаСебестоимости.FIFO ИЛИ ПрошлыйМетод = Перечисления.СпособыРасчетаСебестоимости.LIFO)
		И ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.ПоСреднему Тогда
		
		КорректировкаПоСреднему(Отказ, Движения);
		
	
	ИначеЕсли ПрошлыйМетод = Перечисления.СпособыРасчетаСебестоимости.ПоСреднему И 
		(ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.FIFO ИЛИ ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.LIFO) Тогда
		
		КорректировкаПоПартиям(Отказ, Движения);
		
	КонецЕсли;
		
	
	
КонецПроцедуры

//В этой процедуре мы переходим от партионного учета к беспартионному
Процедура КорректировкаПоСреднему(Отказ, Движения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровНаСкладахОстатки.Склад КАК Склад,
	               |	ПартииТоваровНаСкладахОстатки.Партия КАК Партия,
	               |	СУММА(ПартииТоваровНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	               |	СУММА(ПартииТоваровНаСкладахОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментВремени, Партия <> &ПустаяПартия) КАК ПартииТоваровНаСкладахОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПартииТоваровНаСкладахОстатки.Номенклатура,
	               |	ПартииТоваровНаСкладахОстатки.Склад,
	               |	ПартииТоваровНаСкладахОстатки.Партия
	               |ИТОГИ
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	Номенклатура,
	               |	Склад";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ПустаяПартия", Документы.ЗакупкаТоваров.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаСклад = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
		    //Приход итогов по номенклатуре и складу в пустую партию
			Движение = Движения.ПартииТоваровНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период       = Дата;
	        Движение.Номенклатура = ВыборкаСклад.Номенклатура;
	        Движение.Склад        = ВыборкаСклад.Склад;
	        Движение.Партия       = Документы.ЗакупкаТоваров.ПустаяСсылка();
	        Движение.Количество   = ВыборкаСклад.КоличествоОстаток;
	        Движение.Сумма        = ВыборкаСклад.СуммаОстаток;
			
			ВыборкаДетально = ВыборкаСклад.Выбрать();
		
		
		    //Спускаемся на уровень партий и списываем с них
			Пока ВыборкаДетально.Следующий() Цикл
				
				Движение = Движения.ПартииТоваровНаСкладах.Добавить();
				Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
				Движение.Период       = Дата;
			    Движение.Номенклатура = ВыборкаДетально.Номенклатура;
			    Движение.Склад        = ВыборкаДетально.Склад;
			    Движение.Партия       = ВыборкаДетально.Партия;
			    Движение.Количество   = ВыборкаДетально.КоличествоОстаток;
			    Движение.Сумма        = ВыборкаДетально.СуммаОстаток;
					
			КонецЦикла;
		КонецЦикла;
		
		
	КонецЦикла;
			
				
КонецПроцедуры

//В этой процедуре переходим от пустых партий к партионному учету
Процедура КорректировкаПоПартиям(Отказ, Движения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровНаСкладахОстатки.Склад КАК Склад,
	               |	ПартииТоваровНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПартииТоваровНаСкладахОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментВремени, Партия = &ПустаяПартия) КАК ПартииТоваровНаСкладахОстатки";
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ПустаяПартия", Документы.ЗакупкаТоваров.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//Сначала списываем пустые партии
		Движение = Движения.ПартииТоваровНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад        = Выборка.Склад;
		Движение.Партия       = Документы.ЗакупкаТоваров.ПустаяСсылка();
		Движение.Количество   = Выборка.КоличествоОстаток;
		Движение.Сумма        = Выборка.СуммаОстаток;
		
		//Приход. В качестве партии - ссылка на данный документ
		Движение = Движения.ПартииТоваровНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период       = Дата;
	    Движение.Номенклатура = Выборка.Номенклатура;
	    Движение.Склад        = Выборка.Склад;
	    Движение.Партия       = Ссылка;
	    Движение.Количество   = Выборка.КоличествоОстаток;
	    Движение.Сумма        = Выборка.СуммаОстаток;
		
		
	КонецЦикла;
		
	
	
	
	
КонецПроцедуры
