
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	//При изменении цены автоматически вычисляется сумма
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	//При изменении количества автоматически вычисляется сумма
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры




 //Достаем цену закупа из регистра сведений
&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыНаСервере(Номенклатура)
	ЗначениеРесурсов = РегистрыСведений.ЦенаТовара.Получить(Новый Структура("Номенклатура", Номенклатура));
	
	//Если запись с этим товаром есть - берем цену
	//Если нет - ставим 0
	Если ЗначениеРесурсов <> Неопределено Тогда
		Возврат ЗначениеРесурсов.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции


//Подставляем цену из регистра сведений в форму
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	//Если товаров нет, то и подставлять нечего
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
		Возврат;
	КонецЕсли;
	
	ЦенаИзРегистра = ПолучитьЦенуНоменклатурыНаСервере(СтрокаТабличнойЧасти.Товар);
	
	
	//Подставляем цену, полученную из функции и вычисляем сумму
	СтрокаТабличнойЧасти.Цена = ЦенаИзРегистра; 
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * ЦенаИзРегистра;
КонецПроцедуры


