
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПродажаТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажаТоваров.Дата,
	|	ПродажаТоваров.Номер,
	|	ПродажаТоваров.Покупатель,
	|	ПродажаТоваров.Склад,
	|	ПродажаТоваров.Товары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПродажаТоваров КАК ПродажаТоваров
	|ГДЕ
	|	ПродажаТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры


//Бронирование док-ов из списка
Процедура ВыполнитьБронирование(ТекДок) Экспорт

	Если ТекДок.Проведен Тогда //Если документ проведен, то и бронировать ничего не надо
		Возврат;
	КонецЕсли;
	
	//Временный объект, который хранит в себе коллекцию движений
	//Нужно для управления группы, а не одного объекта отдельно
	НаборЗаписей = РегистрыНакопления.БронированиеТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ТекДок); //Система удалит существующие движения по этому регистру и запишет новые
	
	Для Каждого ТекСтрокаТовары Из ТекДок.Товары Цикл
		
		Движение = НаборЗаписей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекДок.Дата;
		Движение.Номенклатура = ТекстрокаТовары.Товар;
		Движение.Склад = ТекДок.Склад;
		Движение.КоличествоЗабронированного = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
КонецПроцедуры