
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПродажаТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажаТоваров.Дата,
	|	ПродажаТоваров.Номер,
	|	ПродажаТоваров.Покупатель,
	|	ПродажаТоваров.Склад,
	|	ПродажаТоваров.Товары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПродажаТоваров КАК ПродажаТоваров
	|ГДЕ
	|	ПродажаТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры


//Бронирование док-ов из списка
Процедура ВыполнитьБронирование(ТекДок) Экспорт

	Если ТекДок.Проведен Тогда //Если документ проведен, то и бронировать ничего не надо
		Возврат;
	КонецЕсли;
	

	//Временный объект, который хранит в себе коллекцию движений
	//Нужно для управления группы, а не одного объекта отдельно
	НаборЗаписей = РегистрыНакопления.БронированиеТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ТекДок); //Система удалит существующие движения по этому регистру и запишет новые
	НаборЗаписей2 = РегистрыНакопления.СвободныеОстатки.СоздатьНаборЗаписей();
	НаборЗаписей2.Отбор.Регистратор.Установить(ТекДок);
	
	
	//В ЭТОМ ЗАПРОСЕ НУЖНО БУДЕТ ПОМЕНЯТЬ РЕГИСТР ОСТАТКОВ НА РЕГИСТР СВОБОДНЫЕ ОСТАТКИ
	ЗапросОст = Новый Запрос;
	ЗапросОст.Текст = "ВЫБРАТЬ
	                  |	ПродажаТоваровТовары.Товар КАК Товар,
	                  |	СУММА(ПродажаТоваровТовары.Количество) КАК Требуется,
	                  |	ПродажаТоваровТовары.Ссылка.Ссылка КАК Ссылка
	                  |ПОМЕСТИТЬ втДанныеДокумента
	                  |ИЗ
	                  |	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
	                  |ГДЕ
	                  |	ПродажаТоваровТовары.Ссылка = &Ссылка
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ПродажаТоваровТовары.Товар,
	                  |	ПродажаТоваровТовары.Ссылка.Ссылка
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	втДанныеДокумента.Товар КАК Товар,
	                  |	СвободныеОстаткиОстатки.КоличествоВСвободномОстаткеОстаток - втДанныеДокумента.Требуется КАК ПроверкаОстатков,
	                  |	втДанныеДокумента.Требуется КАК Требуется,
	                  |	втДанныеДокумента.Ссылка КАК Ссылка
	                  |ИЗ
	                  |	втДанныеДокумента КАК втДанныеДокумента
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(&МоментВремени, Склад = &Склад) КАК СвободныеОстаткиОстатки
	                  |		ПО втДанныеДокумента.Товар = СвободныеОстаткиОстатки.Номенклатура";
	
	ЗапросОст.УстановитьПараметр("Ссылка", ТекДок.Ссылка);
	ЗапросОст.УстановитьПараметр("МоментВремени", ТекДок.Дата);
	ЗапросОст.УстановитьПараметр("Склад", ТекДок.Склад);
	
	Результат = ЗапросОст.Выполнить();
	ВыборкаТоваров = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока ВыборкаТоваров.Следующий() Цикл
		
		Если ВыборкаТоваров.ПроверкаОстатков < 0 Тогда
			Сообщить("На складе не хватает товара " + ВыборкаТоваров.Товар);
			Возврат;
		Иначе
			Движение = НаборЗаписей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТекДок.Дата;
			Движение.Номенклатура = ВыборкаТоваров.Товар;
			Движение.Склад = ТекДок.Склад;
			Движение.КоличествоЗабронированного = ВыборкаТоваров.Требуется;
			
			//регистр СвободныеОСтатки
			Движение = НаборЗаписей2.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекДок.Дата;
			Движение.Номенклатура = ВыборкаТоваров.Товар;
			Движение.Склад = ТекДок.Склад;
			Движение.КоличествоВСвободномОстатке = ВыборкаТоваров.Требуется;
		КонецЕсли;
	
	
	КонецЦикла;
	
	
	
	НаборЗаписей.Записать();
	НаборЗаписей2.Записать();
КонецПроцедуры